Tauser/NP/firmware/sdkconfig.defaults
# NovaPanel — configuração base.
#
# Este arquivo É versionado: ele carrega as receitas de plataforma pagas com
# depuração em bancada (docs/PATRIMONIO-TECNICO.md §1). Remover uma linha
# daqui sem entender o porquê é como reintroduzir um bug já corrigido.
#
# Cada bloco cita a regra que o justifica.

# ─── alvo e silício ────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"
# O P4 rev v1.3 é REJEITADO pelo bootloader sem estas duas linhas.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# ─── flash e partições ─────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ─── PSRAM ─────────────────────────────────────────────────────────────────
CONFIG_SPIRAM=y
# Mantém malloc()/std::string/std::vector (corpo HTTP, árvore do parser JSON)
# em SRAM interna. RESOURCE-BUDGET.md §2: "tudo que é parsing/rede aloca com
# MALLOC_CAP_INTERNAL". Só os buffers full-size do display vão para PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768

# ─── render: anti-tearing + rotação (ADR-026) ──────────────────────────────
# VALIDADO EM BANCADA (2026-07-26). Três framebuffers são exigidos pelo modo
# TRIPLE_PARTIAL do esp_lvgl_adapter, que é o único que entrega rotação 180° E
# ausência de tearing ao mesmo tempo neste painel. O esp_lvgl_port não combina
# sw_rotate com full_refresh — foi essa limitação que motivou a troca de backend.
#
# NÃO baixar para 2: com rotação != 0 o adapter 0.5.3 falha em silêncio e o LVGL
# entra em loop de assert (aparece como task watchdog). Ver ADR-026.
#
# Custo: 3 × 1024×600×2 B = 3,6 MB de PSRAM.
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=3

# ─── render: alinhamento de buffer de DMA (ADR-010) ────────────────────────
# A linha da cache L2 do P4 tem 64 B, e o draw buffer do LVGL vive em PSRAM
# sendo lido por DMA (PPA/DSI). O default do LVGL é 4 B — muito abaixo.
# Esta é a hipótese principal do glitch de render aberto; ver
# docs/GLITCH-PROTOCOLO.md §2.1. A regra vale mesmo que a hipótese caia:
# buffer de DMA desalinhado é bug latente de qualquer forma.
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=64

# ─── TLS ───────────────────────────────────────────────────────────────────
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Handshake (~130 KB medido) fora da PSRAM: competir com o DMA do display na
# PSRAM foi a causa raiz do "flash branco". RESOURCE-BUDGET.md §1.
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y

# ─── observabilidade ───────────────────────────────────────────────────────
# Coredump fica LIGADO inclusive em produção: a triagem de campo depende dele
# (docs/OPERATIONS.md §3).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# ─── LVGL ──────────────────────────────────────────────────────────────────
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_COLOR_DEPTH_16=y
# Sombra é proibida por regra de render (UI-LAYOUT-SYSTEM.md R5); manter o
# cache em 0 garante que ninguém a use "sem querer" sem pagar o custo visível.
CONFIG_LV_DRAW_SW_SHADOW_CACHE_SIZE=0
# As fontes do produto são subsetadas por papel (UI-LAYOUT-SYSTEM.md §5).
# As Montserrat embutidas ficam disponíveis só para bring-up e mockup.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# A Waveshare expoe uma unica USB fisica ao P4. Como o provisionador recebe
# stdin, USB Serial/JTAG precisa ser o console primario (a saida secundaria
# aceita logs, mas nao entrega bytes recebidos para stdin).
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ─── rede: ESP-Hosted / Wi-Fi remoto (P4 + C6 por SDIO) ────────────────────
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_HOSTED_ENABLED=y
# ATENÇÃO: ligar ESP_HOST_WIFI junto de esp_wifi_remote produz
# "net80211: OS adapter function version error" — os modos são mutuamente
# exclusivos. PATRIMONIO-TECNICO.md §1.
CONFIG_ESP_HOST_WIFI_ENABLED=n
CONFIG_ESP_HOSTED_ENABLE_ITWT=n
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=48
CONFIG_LWIP_UDP_RECVMBOX_SIZE=48
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=48
CONFIG_LWIP_TCP_SACK_OUT=y

# ─── pilhas ────────────────────────────────────────────────────────────────
# A `app_loop` não renderiza mais (ADR-011): render acontece na lvgl_task.
# Mesmo assim 8 KB, porque wiring e drain de fila também custam.
# A pilha da lvgl_task é dimensionada em código, com número MEDIDO —
# ver RESOURCE-BUDGET.md §2.1. Não copiar o valor herdado de 16 KB sem medir.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
